#Assignment 30
#Tower of Hanoi

""" 
ืn= จำนวนจาน
เสา => A,B,C

มีจานจำนวน 3 จาน
n=1
n=2 #ต้องการหยิบใบที่ 2 ใช้(n-1)
n=3 (ใหญ่สุด)
"""
""" 
A => 3 , C => ใหญ่ => เล็ก
ฺB (จุดพักจาน)

A = ล ก ญ
A = ก ญ => C = ล
A = ญ => B = ก
C = ล => B = ล ก
A =  => C = ญ
B = ก => A = ล
B =  => C = ก ญ
A = ล => C = ล ก ญ
"""
def hanoi(n,a,b,c): #(จำนวนจาน,จุดเริ่มย้าย,จุดพัก,จุดวาง)
    if(n==0):
        return
    hanoi(n-1,a,c,b) #ย้ายจานใหญ่จาก A=>C แล้วให้จานเล็กลาง A=>B ให้ C เป็นจุดพัก
    print("จานที่ :", n, "จาก :", a, "พักที่ :", c)
    hanoi(n-1,b,a,c)

hanoi(3,"A","B","C")

